In [1]:
import numpy as np
import pandas as pd

In [3]:
# creating a series from a python dictionary
# remember, dictionary construction uses curly braces {}
samp_dict = {'Archie': 71,
             'Betty': 66,
             'Veronica': 62,
             'Jughead': 72,
             'Cheryl': 66}
samp_series = pd.Series(samp_dict)
print(samp_series) # the series gets alphabetized by its index
actor_dict = {'Archie': "KJ",
              'Jughead': "Cole",
              'Betty': "Lili",
              'Veronica': "Camila",
              'Cheryl': "Madelaine"}  # note that the dictionary order is not same here
actor = pd.Series(actor_dict)  # still get alphabetized by index
print(actor)

Archie      71
Betty       66
Veronica    62
Jughead     72
Cheryl      66
dtype: int64
Archie             KJ
Jughead          Cole
Betty            Lili
Veronica       Camila
Cheryl      Madelaine
dtype: object

# Creating a DataFrame

In [4]:
# we create a dataframe by providing a dictionary of series objects
# the dictionary key becomes the column name
# the dictionary values become values
# the keys within the dictionaries become the indices 
riverdale = pd.DataFrame({'height': samp_series,
                       'actor': actor})  

# the DataFrame will match the indices and sort them
print(riverdale)

          height      actor
Archie        71         KJ
Betty         66       Lili
Cheryl        66  Madelaine
Jughead       72       Cole
Veronica      62     Camila

In [5]:
print(type(riverdale))  # this is a DataFrame object

<class 'pandas.core.frame.DataFrame'>

In [6]:
data = [{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 5}]  # data is a list of dictionaries
# each dictionary needs to have the same set of keys
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 5}]

In [7]:
print(pd.DataFrame(data, index = [1,2,3]))

   a  b
1  0  0
2  1  2
3  2  5

In [8]:
data2 = [{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'c': 5}]  # data is a list of dictionaries
# each dictionary needs to have the same set of keys, otherwise, NAs will appear
data2

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'c': 5}]

In [9]:
pd.DataFrame(data2)  # if the index argument is not supplied, it defaults to integer index start at 0

   a    b    c
0  0  0.0  NaN
1  1  2.0  NaN
2  2  NaN  5.0

In [10]:
data3 = {'a' : [1,2,3], 'b': ['x','y','z']} 
# data3 is a dictionary. the keys form column names, and the values are lists of values
data3

{'a': [1, 2, 3], 'b': ['x', 'y', 'z']}

In [11]:
pd.DataFrame(data3)

   a  b
0  1  x
1  2  y
2  3  z

In [12]:
data = np.random.randint(10, size = 10).reshape([5,2])
print(data)

[[5 9]
 [4 9]
 [4 1]
 [0 7]
 [8 8]]

In [13]:
print(pd.DataFrame(data, columns = ["x","y"], index = ['a','b','c','d','e']))

   x  y
a  5  9
b  4  9
c  4  1
d  0  7
e  8  8

# Subsetting the DataFrame

In [14]:
print(riverdale)

          height      actor
Archie        71         KJ
Betty         66       Lili
Cheryl        66  Madelaine
Jughead       72       Cole
Veronica      62     Camila

In [15]:
print(riverdale.keys())

Index(['height', 'actor'], dtype='object')

In [16]:
riverdale['actor']  # extracting the column

Archie             KJ
Betty            Lili
Cheryl      Madelaine
Jughead          Cole
Veronica       Camila
Name: actor, dtype: object

In [17]:
riverdale.actor

Archie             KJ
Betty            Lili
Cheryl      Madelaine
Jughead          Cole
Veronica       Camila
Name: actor, dtype: object

In [18]:
riverdale.actor[1]

'Lili'

In [19]:
riverdale.actor['Jughead']

'Cole'

In [20]:
print(riverdale.T)  # prints a copy of the transpose

       Archie Betty     Cheryl Jughead Veronica
height     71    66         66      72       62
actor      KJ  Lili  Madelaine    Cole   Camila

# `.loc[]` and `.iloc[]`

In [21]:
print(riverdale.loc['Jughead']) # subset based on location to get a row
print(type(riverdale.loc['Jughead']))
print(type(riverdale.loc['Jughead'].values))  # the values are of mixed type but is still a numpy array. 
# this is possible because it is a structured numpy array. (covered in "Python for Data Science" chapter 2)

height      72
actor     Cole
Name: Jughead, dtype: object
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [22]:
print(riverdale.loc[:,'height']) # subset based on location to get a column
print(type(riverdale.loc[:,'height']))  #the object is a pandas series
print(type(riverdale.loc[:,'height'].values))

Archie      71
Betty       66
Cheryl      66
Jughead     72
Veronica    62
Name: height, dtype: int64
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [23]:
riverdale.loc['Archie','height']  # you can provide a pair of 'coordinates' to get a particular value

71

In [24]:
riverdale.iloc[3,] # subset based on index location

height      72
actor     Cole
Name: Jughead, dtype: object

In [25]:
riverdale.iloc[0, 1] # pair of coordinates

'KJ'

# Importing Data with pd.read_csv()

In [26]:
url = 'https://assets.datacamp.com/production/course_1607/datasets/titanic_sub.csv'
titanic = pd.read_csv(url)

In [27]:
titanic.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
titanic.shape

(891, 11)

In [29]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [30]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.6+ KB

In [31]:
titanic.describe()  # displays summary statistics of the numeric variables

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200